{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/axes_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_3/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "251"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1692"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/free_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "251"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1692"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack", "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_1", "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice_2"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice_1"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/recommender_net_1/strided_slice_3"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/Less", "StatefulPartitionedCall/recommender_net_1/embedding_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/add", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_1/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/SelectV2", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Shape", "StatefulPartitionedCall/recommender_net_1/Tensordot/axes", "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Shape", "StatefulPartitionedCall/recommender_net_1/Tensordot/free", "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_3", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Shape_1", "StatefulPartitionedCall/recommender_net_1/Tensordot/axes_1", "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_3/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_2", "op": "GatherV2", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Shape_1", "StatefulPartitionedCall/recommender_net_1/Tensordot/free_1", "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_2/axis"], "attr": {"batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_1", "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2", "StatefulPartitionedCall/recommender_net_1/Tensordot/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Prod_3", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_3", "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_3"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Prod_2", "op": "Prod", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_2", "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_2"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2", "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_2", "StatefulPartitionedCall/recommender_net_1/Tensordot/concat_2/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Prod", "StatefulPartitionedCall/recommender_net_1/Tensordot/Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/stack_1", "op": "Pack", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Prod_3", "StatefulPartitionedCall/recommender_net_1/Tensordot/Prod_2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2", "StatefulPartitionedCall/recommender_net_1/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2", "StatefulPartitionedCall/recommender_net_1/Tensordot/stack_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape", "StatefulPartitionedCall/recommender_net_1/Tensordot/Reshape_1"], "device": "/device:CPU:0", "attr": {"grad_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot/MatMul", "StatefulPartitionedCall/recommender_net_1/Tensordot/concat_2"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/Tensordot", "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/add", "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/recommender_net_1/add_1", "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/recommender_net_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/recommender_net_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/axes", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/axes_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_3/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_3", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/ReadVariableOp", "shape": [251, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/free", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/ReadVariableOp", "shape": [1692, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_2_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/free_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/GatherV2_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/Tensordot/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/ReadVariableOp", "shape": [251, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_1_2/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/ReadVariableOp", "shape": [1692, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/strided_slice_3/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/embedding_3_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/mul", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/recommender_net_1/batch_normalization_1/batchnorm/sub", "shape": [1], "dtype": "float32"}]}]}